Repository: homolkad/deb-cinder
Catalog: debian/po/*.po
Languages: sv

source: Start cinder services at boot?
sv: Ska cinder-tjänster startas vid systemets uppstart?

source: Please choose whether you want to start Cinder services when the machine is booted up.
sv: Ange om du vill att Cinder-tjänster ska starta när maskinen startar.

source: Set up a database for Cinder?
sv: Ska en databas installeras för Cinder?

source: No database has been set up for Cinder to use. If you want to set one up now, please make sure you have all needed information:
sv: Ingen databas har installerats för Cinder. Innan du fortsätter behöver följande finnas tillgängligt:

source: * the host name of the database server (which must allow TCP connections from this machine); * a username and password to access the database; * the type of database management software you want to use.
sv: * serverns värdnamn (som måste kunna ta emot TCP-anslutningar från den här maskinen) * användarnamn och lösenord för att komma åt databasen. * vilken databastyp du vill använda.

source: If you don't choose this option, no database will be set up and Cinder will use regular SQLite support.
sv: Om något av dessa krav saknar bör du avböja detta alternativ och fortsätta använda sqlite-stödet.

source: You can change this setting later on by running "dpkg-reconfigure -plow cinder-common".
sv: Denna inställning kan ändras senare genom att köra "dpkg-reconfigure -plow cinder-common".

source: Auth server hostname:
sv: Värdnamn för identifieringsserver:

source: Please specify the URL of your Cinder authentication server. Typically this is also the URL of your OpenStack Identity Service (Keystone).
sv: Ange URL till din Cinder-identifieringsserver. Detta är vanligtvis samma URL som till din OpenStack-identitetstjänst (Keystone).

source: Auth server tenant name:
sv: Namn för "tenant" (administratör) på identifieringsservern:

source: Auth server username:
sv: Användarnamn på identifieringsservern:

source: Auth server password:
sv: Lösenord på identifieringsservern:

source: Cinder volume group:
sv: Volymgrupp för Cinder:

source: Please specify the name of the LVM volume group (vg) on which Cinder will create partitions.
sv: Ange namnet för LVM-volym-grupp (vg) där Cinder ska skapa sina partitioner.

source: Register Cinder in the keystone endpoint catalog?
sv: Ska Cinder registreras i keystones katalog med ändpunkter?

source: Each Openstack services (each API) should be registered in order to be accessible. This is done using "keystone service-create" and "keystone endpoint-create". Select if you want to run these commands now.
sv: Alla OpenStack-tjänster (varje API) ska registreras för att kunna användas. Detta görs med kommandona "keystone service-create" och "keystone endpoint-create". Detta kan göras automatiskt nu.

source: Note that you will need to have an up and running keystone server on which to connect using the Keystone auth token.
sv: OBS. Du behöver ha en fungerande keystone-server att ansluta till.

source: Keystone IP address:
sv: IP-adress till Keystone:

source: Enter the IP address of your keystone server, so that cinder-api can contact Keystone to do the Cinder service and endpoint creation.
sv: Ange IP-adressen till din keystone-server så att cinder-api kan kontakta Keystone för att lägga till Cinder-tjänsten som en ändpunkt.

source: Keystone Auth Token:
sv: Autetiseringsvärde för Keystone:

source: To configure its endpoint in Keystone, cinder-api needs the Keystone auth token.
sv: För att lägga till ändpunkt i Keystone behöver cinder-api ett autentiseringsvärde för Keystone.

source: Cinder endpoint IP address:
sv: IP-adress för Cinder-ändpunkt:

source: Enter the IP address that will be used to contact Cinder (eg: the Cinder endpoint IP address).
sv: Ange den IP-adress som ska användas för att kontakta Cinder.

source: This IP address should be accessible from the clients that will use this service, so if you are installing a public cloud, this should be a public IP address.
sv: Denna IP-adress ska vara nåbar från klienterna som vill använda den här tjänsten. Om detta är en publik molntjänst så ska det vara en publik IP-adress.

source: Name of the region to register:
sv: Regionnamn:

source: Openstack can be used using availability zones, with each region representing a location. Please enter the zone that you wish to use when registering the endpoint.
sv: OpenStack kan användas med tillgänglighetszoner. Varje region representerar en plats. Ange zonen som ska användas när ändpunkten registreras.
